---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.ValidateCurveLoops(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ)
source: html/a788bf27-77cc-c11b-7841-6f24e2f1ab14.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.ValidateCurveLoops Method

## Syntax (C#)
```csharp
public static IList<CurveLoop> ValidateCurveLoops(
	IList<CurveLoop> curveLoops,
	XYZ extrDirVec
)
```

## Parameters
- **curveLoops** (`System.Collections.Generic.IList < CurveLoop >`)
- **extrDirVec** (`Autodesk.Revit.DB.XYZ`)